{"keras_version": "2.1.3", "config": [{"config": {"name": "Conv_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "dtype": "float32", "kernel_constraint": null, "activation": "linear", "data_format": "channels_last", "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "filters": 32, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "Activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "Conv_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 64, "kernel_size": [3, 3], "dilation_rate": [1, 1], "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "units": 128, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "units": 10, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "softmax", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}